{
    "Type": 100,
    "Message": "News list successfully returned",
    "Promoted": [],
    "Data": [
        {
            "id": "37806762",
            "guid": "https://coingape.com/?post_type=brandtalk&p=229969",
            "published_on": 1734541102,
            "imageurl": "https://images.cryptocompare.com/news/default/coingape.png",
            "title": "GRVT Launches Gas-Free Bridging for DeFi with XY Finance",
            "url": "https://coingape.com/brandtalk/pulse/grvt-launches-gas-free-bridging-for-defi-with-xy-finance/",
            "body": "Singapore, October 24 , 2024 – Hybrid cryptocurrency exchange GRVT (pronounced “gravity”) , which aims to become the “Goldman Sachs on blockchain”, is thrilled to announce its latest partnership with XY Finance , a cross-chain DEX and bridge aggregator, addressing one of the biggest challenges facing crypto traders today: the complexity and cost of moving assets across different chains and exchanges. The partnership introduces an innovative cross-chain bridging UX by leveraging XY Finance’s Proxy Bridge, to enable CEX-like, gas-free bridging for DeFi. It allows users to seamlessly deposit funds from a CEX directly into GRVT’s smart contract, with no gas fees and no need for multiple wallet transactions — an industry first for DEXs. More importantly, this solution significantly simplifies access for non-crypto native users, who often struggle with the complexities of gas fees, bridging, and related concepts, setting new standards for DeFi and the broader industry. Watch the video to learn more about how this makes DeFi deposit easy. Solving the Biggest Hurdle On-Chain: Cross-Chain Money Moving As the cryptocurrency landscape continues to expand, traders often face significant friction when attempting to move assets between different exchanges and blockchain ecosystems. According to GRVT’s survey with close to 3,000 community members, three key issues are identified with the DeFi user experience: Difficulty in moving money on-chain (45%); Challenging wallet creation and management (20%); Gas fees are a barrier (15%). For retail and institutional users alike, these barriers have slowed the adoption of DeFi and made seamless trading a challenge. GRVT and XY Finance are stepping up to eliminate these pain points, bringing a new level of efficiency and ease to the crypto trading experience. Hong Yea, co-founder and CEO of GRVT, commented, “DeFi adoption remains low, largely because the current landscape requires a steep learning curve, especially for first-time users, with the bridging process being a major pain point. Previously, users had to hold tokens to cover gas fees and complete multiple transactions just to deposit funds into a DEX smart contract. GRVT removes this friction by making these complex DeFi components invisible to the user. Our goal is to bring the benefits of DeFi to a wider audience by simplifying the experience.” Wei Hsuan Huang, Founder and CEO of xSync Network and XY Finance, highlighted, “With the support of xSync Network’s omnichain infrastructure, XY Finance is enabling seamless, bridging from CEXs and any blockchain directly to GRVT. Together with GRVT, we are committed to eliminating the traditional complexities that have kept new users from fully embracing DeFi, offering a streamlined experience that simplifies cross-chain transactions and accelerates broader adoption. This partnership marks another significant milestone for GRVT, as it prepares for the Q4 Mainnet launch. GRVT’s Open Beta Testnet is currently live, with more than 2.5 million users registered on waitlist. For more information and to join the GRVT community, visit grvt.io . Disclaimer: Cryptocurrencies carry high risks. This content is not a distribution of, or an offer or solicitation to provide, financial services or products, nor a representation as to their suitability or legality for you. GRVT is not a regulated entity and your funds are not subject to regulatory protection. Before making any decision based on this content, please seek financial and legal advice, and carefully review our [Risk Disclosure and Disclaimer] in full. Singapore users: GRVT is not licensed, approved, authorised, designated, recognised, registered or otherwise regulated under any legislation administered by the Monetary Authority of Singapore (“MAS”). As such, users will not have the benefit of any regulatory safeguards imposed by the MAS. About GRVT GRVT (pronounced “gravity”) is a hybrid derivatives exchange founded in 2022, offering off-chain order matching and on-chain settlements at an impressive 600,000 TPS. GRVT’s vision is to reinvent the global financial system from its core by leveraging blockchain technology, giving more people the power to generate and fully own their wealth without barriers. With the ambition to build the “Goldman Sachs on blockchain”, GRVT brings institutional expertise to decentralized finance. Our goal is to build an open, scalable marketplace—akin to the “Amazon of DeFi”—where individuals can easily access financial products. GRVT official website : https://grvt.io/ For media inquiries, contact : press@grvt.io Social and Community : X | LinkedIn | Telegram | Discord About XY Finance XY Finance, powered by omnichain service provider xSync Network, is a leading Cross-Chain DEX and Bridge Aggregator, facilitating over $2 billion in volume across 25+ major blockchains and serving a user base of more than 800k. XY Finance allows users to bridge and swap any token across multiple chains, offering the best rates and routes. Developers can leverage XY Finance’s bridge & dex aggregator API and widget to expand their projects, seamlessly connecting to all supported chains to drive growth and adoption. XY Finance Official Website : https://xy.finance/ For media inquiries, contact : alina@xy.finance Social and Community : X | DeBank | Telegram | Discord The post GRVT Launches Gas-Free Bridging for DeFi with XY Finance appeared first on CoinGape .",
            "tags": "pulse",
            "lang": "EN",
            "upvotes": "0",
            "downvotes": "0",
            "categories": "ASIA|BLOCKCHAIN|EXCHANGE|REGULATION|TRADING",
            "source_info": {
                "name": "CoinGape",
                "img": "https://images.cryptocompare.com/news/default/coingape.png",
                "lang": "EN"
            },
            "source": "coingape"
        ]
        }
 }
